app/controllers/villains_controller.rb

  def index
    @villains = Villain.all
---
SELECT "villains".* FROM "villains"

  def show
    id = params[:id]
    @villain = Villain.find(id)
---
SELECT  "villains".* FROM "villains" WHERE "villains"."id" = $1 LIMIT 1  [["id", 1]]

  def create
    villain_params = params.require(:villain).permit(:name, :description, :avatar)
    @villain = Villain.new(villain_params)
    if @villain.save
---
INSERT INTO "villains" ("name", "description", "avatar_file_name", "avatar_content_type", "avatar_file_size", "avatar_updated_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def edit
    id = params[:id]
    @villain = Villain.find(id)
---
SELECT  "villains".* FROM "villains" WHERE "villains"."id" = $1 LIMIT 1  [["id", 1]]

  def update
    villain_id = params[:id]
    villain = Villain.find(villain_id)

    updated_attributes = params.require(:villain).permit(:name, :description, :avatar)

    villain.update_attributes(updated_attributes)
---
SELECT  "villains".* FROM "villains" WHERE "villains"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "villains" SET "avatar_updated_at" = $1, "avatar_file_name" = $2, "updated_at" = $3 WHERE "villains"."id" = $4  [["avatar_updated_at", "2015-08-12 04:22:18.649498"], ["avatar_file_name", "golbez.jpg"], ["updated_at", "2015-08-12 04:22:19.673336"], ["id", 2]]

  def destroy
    id = params[:id]
    villain = Villain.find(id)
    villain.destroy
---
SELECT  "villains".* FROM "villains" WHERE "villains"."id" = $1 LIMIT 1  [["id", 1]]
DELETE FROM "villains" WHERE "villains"."id" = $1  [["id", 1]]